init.org
***  Bidirectional Editing

Emacs supports bidirectional editing. This is rarely used feature for many and can actually result in slower performance. To improve performance if bidirectional editing it not used, the following can be set:

1. Tell Emacs that text should be read from left to right.

   #+begin_src emacs-lisp :noweb-ref emacs_custom
     (bidi-paragraph-direction 'left-to-right)
   #+end_src

2. Turn off bidrectional editing mode.
   
   #+begin_src emacs-lisp :noweb-ref emacs_config
     (if (version<= "27.1" emacs-version)
         (setq bidi-inhibit-bpa t))
    #+end_src
    
*** Desktop Save Mode :disabled:

The following option will cause Emacs to always save the state of Emacs when it was closed. Local buffers, tabs in ~tab-bar-mode~, and window arrangements are all saved if possible. Turning this on makes it much simpler to continue working on the same projects when Emacs is closed and then opened again.

#+begin_src emacs-lisp :noweb-ref emacs_custom
  ;;(desktop-save-mode t)
#+end_src

*** Display Battery Mode

Display Battery Mode will display the battery charge status in the modeline 

#+begin_src emacs-lisp :noweb-ref emacs_config
  (display-battery-mode t)
#+end_src

*** File Deletion and Backup

Changing how Emacs deletes files and how it creates backups.

**** Send Deleted Files to System Trash

 Emacs does not send files to the trash by default which is counter-intuitive for many beginning users. /In order to risk losing files it is a good idea to turn on the option to send all files to the system trash./

 #+begin_src emacs-lisp :noweb-ref emacs_custom
   (delete-by-moving-to-trash t)
 #+end_src
 
**** Backup Files with Version Control

 Emacs has a built-in version control system in which it will create a series of backup files. This will create a number of backup flies, however, that will need to be cleaned up on a regular basis.


 #+begin_src emacs-lisp :noweb-ref emacs_custom
   (version-control t)
   (delete-old-versions t)
   (vc-make-backup-files t)
 #+end_src
 
*** Inhibit Startup Screen

After seeing the startup screen hundreds of times, there is no longer any need to load it on startup as it no longer contains any new information.

#+begin_src emacs-lisp :noweb-ref emacs_custom
  (inhibit-startup-screen t)
#+end_src

*** Register Delay

#+begin_src emacs-lisp :noweb-ref emacs_custom
  (register-preview-delay 0)
#+end_src

*** Ring Bell Function

#+begin_src emacs-lisp :noweb-ref emacs_custom
  (ring-bell-function #'ignore)
  (visible-bell t)
#+end_src

*** Shorten "Yes or No" to "Y or N"

To make work faster, instead of typing "yes" or "no" for each question prompt, use just "y" or "n"
.

#+begin_src emacs-lisp :noweb-ref emacs_config
  (fset 'yes-or-no-p 'y-or-n-p)
#+end_src

* Elfeed

Elfeed is a news and RSS reader for Emacs. The configuration for Elfeed can be found at [[file:modules/elfeed/freemacs-elfeed.org][elfeed module]].

#+begin_src emacs-lisp :tangle yes
  ;; Load Elfeed newsreader module

  (require 'freemacs-elfeed)
#+end_src

* Email

Email is managed using the Mu4e package that uses the Mu backend to search through emails that are stored using the Maildir format. The configuration can be found at [[file:modules/email/freemacs-email.org][email module]].

#+begin_src emacs-lisp :tangle yes
  ;; Load email module

  (require 'freemacs-email)
#+end_src

* Coding

Modifications to the coding modes for Emacs are defined in the [[file:modules/coding/freemacs-coding.org][coding module]].

#+begin_src emacs-lisp :tangle yes
  ;; Load the coding module

  (require 'freemacs-coding)
#+end_src

* Completion

While Emacs has built-in completion systems, the combination of the following tools makes Emacs completion very powerful:

+ Vertico
+ Orderless
+ Cape
+ Consult
+ Marginalia
+ Embark

The configuration of these elements can be found in the [[file:modules/completion/freemacs-completion.org][completion module]].

#+begin_src emacs-lisp :tangle yes
  ;; Load the completion module

  (require 'freemacs-completion)
#+end_src

* File Management

#+begin_src emacs-lisp :tangle yes
  ;; Load file tools module

  (require 'freemacs-dired)
#+end_src

[[https://github.com/sunrise-commander/sunrise-commander][Sunrise Commander]] is a two-pane orthodox file manager similar to Midnight Commander.

#+begin_src emacs-lisp :tangle yes
  ;; Load sunrise module

  (require 'freemacs-sunrise)
#+end_src

* Navigation and Session

This section contains customizations for controlling how to navigate between Emacs windows, frames, and buffers.

#+begin_src emacs-lisp :tangle yes
  ;; Navigation and Session Configuration
#+end_src

** Bufler

[[https://github.com/alphapapa/bufler.el][Bufler]] provides a buffer switching menu that has some enhanced automatic groupings that make it easier to configure than [[https://www.emacswiki.org/emacs/IbufferMode][Ibuffer]] as it requires less manual work to create buffer groups. It can also sort buffers into groups based on projects using ~project.el~.

#+begin_src emacs-lisp :tangle yes
  (use-package bufler
    :straight t
    :bind ("C-x C-b" . bufler))
#+end_src

** Burly

[[https://github.com/alphapapa/burly.el][Burly]] is a tool to save buffer, window, and frame configurations among sessions. Although Emacs has Tab Bar Mode and Desktop Mode, Burly has a couple benefits that make it worth adopting for some:

1. Saving the Emacs Desktop automatically opens it on the next session which can slow down Emacs load time especially if you only wish to start a new session without opening any of the old buffers.
2. Burly allows you save the different sessions with names so you can call up different sessions as you choose.
3. Loading of Burly can be deferred until you call the Burly commands.

#+begin_src emacs-lisp :tangle yes :noweb yes
  (use-package burly
    :straight (burly :host github
                     :repo "tfree87/burly.el"
                     :branch "master")
    :commands (burly-bookmark-frames
               burly-bookmark-windows
               burly-open-bookmark))
#+end_src

** Recentf Mode

Recentf Mode will save a list of recent files so they can be called easily after restarting Emacs. To access the files, ~M-x recentf-open-files~ can be called to get a list of the recent files in a buffer.

#+begin_src emacs-lisp :noweb-ref emacs_config
  (recentf-mode 1)
#+end_src

** Winner Mode

[[https://www.emacswiki.org/emacs/WinnerMode][Winner Mode]] makes it easy to return to old window configurations in Emacs by simply using the keyboard command ~C-<left>~.

#+begin_src emacs-lisp :noweb-ref emacs_config
  (winner-mode t)
#+end_src

** Winum

Winum is a package that adds number to the modeline for each window in Emacs. Windows can then easily be switched from one to the next by using the key combination ~C-x w~ followed by the number of the correct window.

This package is similar to [[https://github.com/abo-abo/ace-window][ace-window]] but it has a few advantages:

1. This package has a key binding that does not conflict with ~M-o~ in [[Sunrise Commander]]
2. This package works well with [[https://github.com/ch11ng/exwm][EXWM]]. Ace Window numbers do not display in [[https://github.com/ch11ng/exwm][EXWM]] windows that are running X11 applications.
3. ~C-x w~ is similar to the window creation and deletion commands ~C-x~ which may make it easier to remember the key binding.

#+begin_src emacs-lisp :tangle yes
  (use-package winum
    :straight t
    :defer 3
    :config
    (winum-mode t))
#+end_src

* Org

#+begin_src emacs-lisp :tangle yes
  ;; Load the Org Mode module

  (require 'freemacs-org)
#+end_src

* Writing/Publishing/Reading

This section contains customizations for Emacs to improve the environment for writing papers, publishing paper and websites, and reading documents.

#+begin_src emacs-lisp :tangle yes
  ;; Writing/Publishing/Reading Configuation
#+end_src

** Academic Phrases

[[https://github.com/nashamri/academic-phrases][Academic phrases]] is a package that provides a number of easy-to-use templates for writing academic text if you happen to have writer's block. Calling the function ~M-x academic-phrases~ provides a searchable list of these templates for your use.

#+begin_src emacs-lisp :tangle yes
  (use-package academic-phrases
    :straight t
    :defer t)
#+end_src

** AUCTeX :LaTeX:

[[https://www.gnu.org/software/auctex/][AUCTeX]] for writing documents using \LaTeX{}.

#+begin_src emacs-lisp :tangle yes :noweb yes
    (use-package auctex
      :straight t
      :defer t
      :custom
      (TeX-auto-save t)
      (TeX-parse-self t)
      (TeX-master nil)
      <<auctex_custom>>)
#+end_src

*** Use BibLaTeX

BibLaTeX has more powerful features than standard BibTeX.

#+begin_src emacs-lisp :noweb-ref auctex_custom
(bibtex-dialect 'biblatex)
#+end_src

** Citations :org:

This section contains customizations for adding citations into documents in Emacs.

*** Citar

[[https://github.com/emacs-citar/citar][Citar]] is a citation tool that integrates well with [[Vertico]], [[Embark]], and [[Marginalia]].

#+begin_src emacs-lisp :tangle yes
  (use-package citar
    :straight (citar :host github
                     :repo "emacs-citar/citar"
                     :branch "main")
    :after org
    :custom
    (citar-bibliography org-cite-global-bibliography))
#+end_src

*** Org Citation Options :org:

The following lines will tell Org Mode to use Citar as the processor for ~org-cite~ and will tell Org Mode where to find the default bibliography file.

#+begin_src emacs-lisp :noweb-ref org_customize
  (org-cite-global-bibliography '("~/bib/bib.bib"))
  (org-cite-insert-processor 'citar)
  (org-cite-follow-processor 'citar)
  (org-cite-activate-processor 'citar)
#+end_src

** Flyspell

Flyspell mode can be hooked to various buffer modes so that spell-checking can be done as typing occurs. As you type, a red wavy line will appear under text that it deems to be incorrectly spelled.

In order for this to work in Windows, hunspell must be installed with the proper dictionaries. I have downloaded hunspell from ezwinports and included it in my ~~/.emacs.d/~ directory so that I can also use hunspell when I am using Emacs as a portable app from a USB drive. To use hunspell for spell checking, we must first configure the ispell package:

#+begin_src emacs-lisp :tangle yes
  (use-package ispell
    :straight (:type built-in)
    :defer t
    :config
    (if (eq system-type 'windows-nt)
      (progn (setq ispell-program-name (expand-file-name "~/.emacs.d/hunspell/bin/hunspell.exe"))
             (setq ispell-personal-dictionary "~/.emacs.d/hunspell_en_US")
             (setq ispell-local-dictionary "en_US")
             (setq ispell-local-dictionary-alist
                   '(("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_US") nil utf-8))))
        (setq ispell-program-name (whicher "hunspell"))))
#+end_src

Once hunspell is set up as the default spell checker, we can then hook flyspell into our editing modes.

#+begin_src emacs-lisp :tangle yes
  (use-package flyspell
    :straight (:type built-in)
    :defer t
    :init
    (add-hook 'prog-mode-hook 'flyspell-prog-mode)
    (add-hook 'text-mode-hook 'flyspell-mode))
#+end_src

** Markdown Mode

[[https://jblevins.org/projects/markdown-mode/][Markdown Mode]] for markdown files. While I prefer Org-mode for rich-text editing in Emacs, Github primarily supports markdown so I want to be able to edit and view these files when needed.

#+begin_src emacs-lisp :tangle yes :noweb no-export
  (use-package markdown-mode
    :straight t
    :mode ("\\.\\(m\\(ark\\)?down\\|md\\)$" . markdown-mode)
    :init
    (whicher "pandoc")
    <<markdown_init>>
    :config
    (bind-key "A-b" (surround-text-with "+*") markdown-mode-map)
    (bind-key "s-b" (surround-text-with "**") markdown-mode-map)
    (bind-key "A-i" (surround-text-with "*") markdown-mode-map)
    (bind-key "s-i" (surround-text-with "*") markdown-mode-map)
    (bind-key "A-=" (surround-text-with "`") markdown-mode-map)
    (bind-key "s-=" (surround-text-with "`") markdown-mode-map))
#+end_src

*** Set Markdown Mode to use Pandoc

Since [[https://pandoc.org/][Pandoc]] can be installed on both Linux and in Windows with Chocolatey, set Markdown Mode to use this as the default markdown command.

#+begin_src emacs-lisp :noweb-ref markdown_init
  (setq markdown-command '("pandoc" "--from=markdown" "--to=html5"))
#+end_src

** PDF Tools :guix:

[[https://github.com/politza/pdf-tools][PDF Tools]] is a faster and more feature-rich than the built in DocView. Currently, I install this package using the GUIX package manager.

#+begin_src emacs-lisp :tangle yes
  (use-package pdf-tools
    :magic ("%PDF" . pdf-view-mode)
    :config
    (pdf-loader-install :no-query))
#+end_src

