init.el
  (bidi-paragraph-direction 'left-to-right)
  ;;(desktop-save-mode t)
  (delete-by-moving-to-trash t)
  (version-control t)
  (delete-old-versions t)
  (vc-make-backup-files t)
  (inhibit-startup-screen t)
  (register-preview-delay 0)
  (ring-bell-function #'ignore)
  (visible-bell t)
  (sentence-end-double-space nil)
  :config
  (add-hook 'before-save-hook 'time-stamp)
  (if (version<= "27.1" emacs-version)
      (setq bidi-inhibit-bpa t))
  (display-battery-mode t)
  (fset 'yes-or-no-p 'y-or-n-p)
  (recentf-mode 1)
  (winner-mode t))

;; Load Elfeed newsreader module

(require 'freemacs-elfeed)

;; Load email module

(require 'freemacs-email)

;; Load the coding module

(require 'freemacs-coding)

;; Load the completion module

(require 'freemacs-completion)

;; Load file tools module

(require 'freemacs-dired)

;; Load sunrise module

(require 'freemacs-sunrise)

;; Navigation and Session Configuration

(use-package bufler
  :straight t
  :bind ("C-x C-b" . bufler))

(use-package burly
  :straight (burly :host github
                   :repo "tfree87/burly.el"
                   :branch "master")
  :commands (burly-bookmark-frames
             burly-bookmark-windows
             burly-open-bookmark))

(use-package winum
  :straight t
  :defer 3
  :config
  (winum-mode t))

;; Load the Org Mode module

(require 'freemacs-org)

;; Writing/Publishing/Reading Configuation

(use-package academic-phrases
  :straight t
  :defer t)

(use-package auctex
  :straight t
  :defer t
  :custom
  (TeX-auto-save t)
  (TeX-parse-self t)
  (TeX-master nil)
  (bibtex-dialect 'biblatex))

(use-package citar
  :straight (citar :host github
                   :repo "emacs-citar/citar"
                   :branch "main")
  :after org
  :custom
  (citar-bibliography org-cite-global-bibliography))

(use-package ispell
  :straight (:type built-in)
  :defer t
  :config
  (if (eq system-type 'windows-nt)
    (progn (setq ispell-program-name (expand-file-name "~/.emacs.d/hunspell/bin/hunspell.exe"))
           (setq ispell-personal-dictionary "~/.emacs.d/hunspell_en_US")
           (setq ispell-local-dictionary "en_US")
           (setq ispell-local-dictionary-alist
                 '(("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_US") nil utf-8))))
      (setq ispell-program-name (whicher "hunspell"))))

(use-package flyspell
  :straight (:type built-in)
  :defer t
  :init
  (add-hook 'prog-mode-hook 'flyspell-prog-mode)
  (add-hook 'text-mode-hook 'flyspell-mode))

(use-package markdown-mode
  :straight t
  :mode ("\\.\\(m\\(ark\\)?down\\|md\\)$" . markdown-mode)
  :init
  (whicher "pandoc")
  (setq markdown-command '("pandoc" "--from=markdown" "--to=html5"))
  :config
  (bind-key "A-b" (surround-text-with "+*") markdown-mode-map)
  (bind-key "s-b" (surround-text-with "**") markdown-mode-map)
  (bind-key "A-i" (surround-text-with "*") markdown-mode-map)
  (bind-key "s-i" (surround-text-with "*") markdown-mode-map)
  (bind-key "A-=" (surround-text-with "`") markdown-mode-map)
  (bind-key "s-=" (surround-text-with "`") markdown-mode-map))

(use-package pdf-tools
  :magic ("%PDF" . pdf-view-mode)
  :config
  (pdf-loader-install :no-query))
