init.org
*** Single Space at the End of Sentences

Emacs when navigating expects sentences to end with a double space after a period. While this makes documents written in plain text to look more attractive and more readable, this convention is not used much anymore and this will break emacs commands for killing and navigating sentences.

#+begin_src emacs-lisp :noweb-ref emacs_custom
  (sentence-end-double-space nil)
#+end_src

* Shells and Terminals

This section contains configuration options for terminals in Emacs. 

#+begin_src emacs-lisp :tangle yes
  ;; Shells and Terminals Configuration
#+end_src

** Eshell

Eshell is a very powerful lisp-based shell that I have learned to love most because you can redirect output directly to Emacs buffers. This feature has made it my default shell and I have switched to it from using mostly Z shell because I send stuff to and from Emacs buffers. This feature really is a game changer.

#+begin_src emacs-lisp :tangle yes :noweb yes
  (use-package eshell
    :straight (:type built-in)
    :defer t
    :hook
    <<eshell_prompt>>
    (eshell-mode . (lambda ()
                     <<eshell_visual_commands>>
                     <<eshell_aliases>>))
    :custom
    (eshell-error-if-no-glob t)
    (eshell-hist-ignoredups t)
    (eshell-save-history-on-exit t)
    (eshell-destroy-buffer-when-process-dies t)
    :config
    (setenv "PAGER" "cat"))
  #+end_src
  
*** Eshell Aliases

Below are a list of command-line aliases for use in eshell.

#+name: eshell_aliases
#+begin_src emacs-lisp :noweb-ref eshell_aliases
  (eshell/alias "ff" "find-file $1")
  (eshell/alias "emacs" "find-file $1")
  (eshell/alias "untar" "tar -zxvf")
  (eshell/alias "cpv" "rsync -ah --info=progress2")
  (eshell/alias "ll" "ls -Alh")
#+end_src

*** Eshell Visual Commands

Many commands when run in eshell turn into a mess as it is not an ansi-term. Any interactive commands that need the full ansi-term to display properly are listed below so that when they are run from the eshell they will open in ansi-tem and display properly.

#+name: eshell_visual_commands
#+begin_src emacs-lisp :noweb-ref eshell_visual_commands
  (add-to-list 'eshell-visual-commands "htop")
  (add-to-list 'eshell-visual-commands "ipython")
  (add-to-list 'eshell-visual-commands "rclone")
  (add-to-list 'eshell-visual-commands "ssh")
  (add-to-list 'eshell-visual-commands "tail")
  (add-to-list 'eshell-visual-commands "top")
#+end_src

*** Esh Autosuggest

#+begin_src emacs-lisp :tangle yes
  (use-package esh-autosuggest
    :straight t
    :hook (eshell-mode . esh-autosuggest-mode))
#+end_src

*** Eshell Git Prompt

[[https://github.com/xuchunyang/eshell-git-prompt][Eshell Git Prompt]] provides a series of Eshell prompts that provide extra information including the git status of the current project.

#+begin_src emacs-lisp :tangle yes
  (use-package eshell-git-prompt
    :straight (emacs-git-prompt :host github
                                :repo "tfree87/eshell-git-prompt"
                                :branch "master")
    :defer t)
#+end_src

**** Set the Eshell prompt on load

This method was the only method I have found that loaded the ~eshell-git-prompt~ immediately when Eshell was loaded.

#+begin_src emacs-lisp :noweb-ref eshell_prompt
  (eshell-load . (lambda ()
                        (eshell-git-prompt-use-theme 'multiline2)))
#+end_src

*** Eshell Toggle

[[https://github.com/4DA/eshell-toggle][Eshell Toggle]] makes it easy to pull up a temporary Eshell buffer for running commands quickly from the working directory of that buffer.

#+begin_src emacs-lisp :tangle yes
  (use-package eshell-toggle
    :straight (eshell-toggle :repo "4DA/eshell-toggle"
                             :host github
                             :repo "master")
    :custom
    (eshell-toggle-size-fraction 3)
    (eshell-toggle-run-command nil)
    (eshell-toggle-init-function #'eshell-toggle-init-eshell)
    :bind
    ("M-s-`" . eshell-toggle))
#+end_src

*** Oh My Esh

Oh My Esh is my pacakge that aims to reproduce some of the plugin functionality that can be found in the plugins from Oh My Zsh for the Z shell.

#+begin_src emacs-lisp :tangle yes
  (use-package oh-my-eshell
    :straight (oh-my-eshell :repo "tfree87/OhMyEshell"
                            :branch "main"
                            :host github)
    :after eshell)
#+end_src

** PowerShell :Windows:

[[https://github.com/jschaf/powershell.el][Powershell.el]] creates a function that will launch an inferior shell that will run the Windows PowerShell tool.

#+begin_src emacs-lisp :tangle yes
  (use-package powershell
    :straight t
    :if (eq system-type 'windows-nt)
    :defer t
    :init
    (whicher "powershell.exe")
    :config
    ;; Change default compile command for powershell
    (add-hook 'powershell-mode-hook
              (lambda ()
                (set (make-local-variable 'compile-command)
                     (format
                       "powershell.exe -NoLogo -NonInteractive -Command \"& '%s'\"")
                      (buffer-file-name)))))
#+end_src

** Vterm :guix:

Vterm is a terminal emulator in Emacs that is written in C and compiled on the host system. This makes it faster than than ~term~ or ~ansi-term~ in Emacs. It also replicates a traditional terminal more closely than the other options in Emacs.

#+begin_src emacs-lisp :tangle yes
  (use-package vterm
    :defer t)
#+end_src

* Theme

Changes to Emacs appearance and theme can be found in the [[file:modules/theme/freemacs-theme.org][theme module]].

#+begin_src emacs-lisp :tangle yes
  ;; Load theme module

  (require 'freemacs-theme)
#+end_src

#+begin_src emacs-lisp :tangle yes
  (require 'freemacs-alltheicons)
#+end_src

* EXWM

EXWM is a window manager that runs entirely wihtin Emacs. With EXWM, Emacs frames and windows can be used to manage X11 applications. Each X11 application runs in a separate window and can be accessed as a separate buffer using Emacs commands.

#+begin_src emacs-lisp :tangle yes
  ;; Load the EXWM module

  (require 'freemacs-exwm)
#+end_src

* Other

This section contains configuration for packages that do no fit into the other categories.

** Docker

[[https://github.com/Silex/docker.el][Docker Mode]] is an interface in Emacs to manage Docker containers.

#+begin_src emacs-lisp :tangle yes
  (use-package docker
    :straight t
    :init
    (whicher "docker")
    :bind ("C-c d" . docker))
#+end_src

** Docker Compose

[[https://github.com/meqif/docker-compose-mode][Docker Compose Mode]] is a major mode for editing Docker Compose files.

#+begin_src emacs-lisp :tangle yes
  (use-package docker-compose-mode
    :straight t
    :defer t
    :init
    (whicher "docker-compose"))
#+end_src

** EMMS :disabled:

/This package has been disabled as it provides little use for me./

EMMS is a multimedia player for Emacs. It is an interface that is used to control other players that operate in the background.

#+begin_src emacs-lisp :tangle yes
  (use-package emms
    :straight t
    :defer t
    :custom
    (emms-source-file-default-directory "~/Music/")
    :config
    (require 'emms-setup)
    (emms-all)
    (emms-default-players)
    (global-set-key (kbd "<XF86AudioPrev>") 'emms-previous)
    (global-set-key (kbd "<XF86AudioNext>") 'emms-next)
    (global-set-key (kbd "<XF86AudioPlay>") 'emms-pause))
#+end_src

** Gnuplot

[[https://github.com/emacs-gnuplot/gnuplot][Gnuplot]] mode can be used for editing files that are used to define a plot style and layout and allow for execution of the code in an Emacs buffer.

#+begin_src emacs-lisp :tangle yes
  (use-package gnuplot
    :straight t
    :init
    (whicher "gnuplot")
    :defer t)
#+end_src

** Helpful

[[https://github.com/Wilfred/helpful][Helpful]] improves the Emacs help functions by adding new features to the ~*Help*~ buffers such as:

- Links to source code
- Better formatting of docstrings
- Lists of callers
- Keymaps
- Aliases
- And more...

#+begin_src emacs-lisp :tangle yes
  (use-package helpful
    :straight t
    :defer t
    :bind
    ("C-h f" . #'helpful-callable)
    ("C-h v" . #'helpful-variable)
    ("C-h k" . #'helpful-key)
    ("C-c C-d" . #'helpful-at-point)
    ("C-h F" . #'helpful-function)
    ("C-h C" . #'helpful-command))
#+end_src

** Ledger

To conduct plain-text accounting in Emacs, [[https://github.com/ledger/ledger-mode][ledger-mode]] needs to be installed from the package repositories. This mode will create faces for the text and highlight transactions while also providing the functionality to execute ledger reports in an Emacs buffer. No shell needed.

#+begin_src emacs-lisp :tangle yes
    (use-package ledger-mode
      :straight t
      :defer t
      :init
      (whicher "ledger"))
#+end_src

** Multiple Cursors

[[https://github.com/magnars/multiple-cursors.el][multiple-cursors.el]] allows for editing Emacs buffers at multiple locations simultaneously at the same time and has transformed how I use Emacs Dired. I can use it to edit many file names at once in a directory by making any dired buffer editable by pressing =C-x C-q=.

#+begin_src emacs-lisp :tangle yes
  (use-package multiple-cursors
    :straight t
    :defer t
    :bind
    ("C-S-c C-S-c" . 'mc/edit-lines)
    ("C->" . 'mc/mark-next-like-this)
    ("C-<" . 'mc/mark-previous-like-this)
    ("C-c C-<" . 'mc/mark-all-like-this))
#+end_src

** PlantUML

[[https://plantuml.com/][PlantUML]] is a language that can interpret code to create flowcharts and UML diagrams. The syntax is similar to programming languages thereby making it fast and easy to create accurate, auto-generated charts that don't require a lot of dragging boxes around as you might with a graphical tool such as LibreOffice Draw.

*** Install PlantUML Mode

[[https://github.com/skuro/plantuml-mode][PlantUML mode]] is not installed by default, so we need ~use-package~ to download and install it.

#+begin_src emacs-lisp :tangle yes
  (use-package plantuml-mode
    :straight t
    :defer t
    :after org)
#+end_src

*** Set Location of PlantUML Binary

When Emacs is run as a portable app on a USB drive, Emacs needs to know the location of the PlantUML executable which I place in the .emacs.d directory.

#+begin_src emacs-lisp :noweb-ref org_customize
  (org-plantuml-jar-path (expand-file-name "~/.emacs.d/plantuml/plantuml.jar"))
#+end_src

** Popper

[[https://github.com/karthink/popper][Popper]] lets a user define any window as a short-term pop up window.

#+begin_src emacs-lisp :tangle yes :noweb yes
  (use-package popper
    :straight t
    :bind (("C-`"   . popper-toggle-latest)
           ("M-`"   . popper-cycle)
           ("C-M-`" . popper-toggle-type))
    :init
    <<popper_init>>
    (popper-mode +1)
    (popper-echo-mode +1))
#+end_src

*** Popper Buffer Buffers

For each buffer that will become a popper pop up buffer, it must be defined below:

#+begin_src emacs-lisp :noweb-ref popper_init
  (setq popper-reference-buffers
          '("\\*Messages\\*"
            "\\*Embark Actions\\*"
            "Output\\*$"
            "\\*Async Shell Command\\*"
            "\\*Whicher Report\\*"
            help-mode
            compilation-mode))
#+end_src

** Savehist

Savehist will save the selections from completion history between Emacs sessions. This makes it so that commonly used commands and files will float to the top of the minibuffer in [[Vertico]].

#+begin_src emacs-lisp :tangle yes :noweb yes
  (use-package savehist
    :straight (:type built-in)
    :init
    (savehist-mode))
  #+end_src
  
